Repository: DrLarck/pantheist
Catalog: locale/*/LC_MESSAGES/*.po
Languages: fr

source: <@{}> You're about to **perma-ban {}**, are you sure about that ? *(Type `{}yes` or `{}no` to proceed)*
fr: <@{}> Vous êtes sur le point de **perma-ban {}**, êtes-vous sûr de vouloir bannir cet utilisateur ? *(Tapez `{}yes` ou `{}no` à la suite pour continuer)*

source: <@{}> You're about to **ban {}** for **{:,}** seconds. Are you sure about that ? *(Type `{}yes` or `{}no` to proceed)*
fr: <@{}> Vous êtes sur le point de **ban {}** pour une durée de **{:,}** secondes. Êtes-vous sûr de vouloir faire cela ? *(Tapez `{}yes` ou `{}no` à la suite pour continuer)*

source: <@{}> Error : a required argument is missing.
fr: <@{}> Erreur : un paramètre nécessaire est manquant.

source: <@{}> Error : I can't find this user.
fr: <@{}> Erreur : Je ne parviens pas à trouver cet utilisateur.

source: Help
fr: Aide

source: Welcome in the help panel. A parameter between [square brackets] is **necessary**, otherwise the command will not work. A parameter between {braces} is **optional**. The '**@**' symbol means that the command needs a **mention**. By default, the temp-ban is set to 1 day. Prefix : `**` :bookmark:[GitHub Repository](https://github.com/DrLarck/pantheist)
fr: Bienvenue dans le panneau d'aide. Un paramètre entre [crochets] est **obligatoire**, sinon la commande ne fonctionnera pas. Un paramètre entre {accolades} est **facultatif**. Le symbole '@' signifie que vous devez **mentionner** pour que la commande fonctionne. Par défaut, la durée du temp-ban est définie à 1 jour. Préfixe : `**` :bookmark:[GitHub Repository](https://github.com/DrLarck/pantheist)

source: ban [@user] {time: seconds} {"reason"}
fr: ban [@utilisateur] {temps: en secondes} {"raison"}

source: mute [@user] [duration seconds] {"reason"}
fr: mute [@utilisateur] [durée en secondes] {"raison"}

source: kick [@user] {reason}
fr: kick [@utilisateur] {raison}

source: language [EN or FR]
fr: language [EN ou FR]

source: warn | w [@user] {"reason"}
fr: warn | w [@utilisateur] {"raison"}

source: [Perm : ban members] - Allows you to ban a member from the server. If it's a **temp-ban**, please pass the time as **seconds**. Also pass the **reason** between "quotation marks".
fr: [Perm : bannir des membres] - Vous permet de bannir un membre du serveur. Si c'est un **temp-ban**, merci de bien vouloir passer le temps en **secondes**. De plus, la **raison** doit être passée entre "guillemets".

source: [Perm : kick members] - Allow you to mute a member for a certain amount of time (in seconds).
fr: [Perm : expulser des membres] - Vous permet de mute un membre pour une certaine durée (en secondes).

source: [Perm : kick members] - Allows you to kick a member from the server.
fr: [Perm : expulser des membres] - Vous permet d'expulser un membre du serveur.

source: [Perm : everyone] - Allows you to change the bot language.
fr: [Perm : everyone] - Vous permet de changer la langue du bot.

source: [Perm : kick members, ban members] - Allows you to warn a user, after a certain amount of warns the warn system will invite you to kick/temp-ban the user.
fr: [Perm : expulser des membres, bannir des membres] - Vous permet de donner un avertissement à un utilisateur, après un certain nombre d'avertissements, le système vous demandera si vous souhaitez expulser/temp-ban l'utilisateur.

source: <@{}> You're about to **kick {}**, are you sure that you want to kick this user ? *(Type `{}yes` or `{}no` to proceed)*
fr: <@{}> Vous êtes sur le point d'**expulser {}**, êtes-vous sûr de vouloir expulser cet utilisateur ? *(Tapez `{}yes` ou `{}no` à la suite pour continuer)*

source: <@{}> Please select a language between `EN` and `FR`.
fr: <@{}> Veuillez sélectionner une langue entre `EN` et `FR`.

source: <@{}> An invalid argument has been passed.
fr: <@{}> Un paramètre invalide a été donné.

source: <@{}> I've muted **{}** for **{:,}** seconds.
fr: <@{}> J'ai mute **{}** pour une durée de **{:,}** secondes.

source: <@{}> You've been muted for **{:,}** seconds by **{}** in `{}`. *No reason provided.*
fr: <@{}> Vous avez été mute pour une durée **{:,}** secondes par **{}** dans `{}`. *Aucune raison fournie.*

source: <@{}> You've been muted for **{:,}** seconds by **{}** in `{}`. Reason : *"{}"*
fr: <@{}> Vous avez été mute pour une durée **{:,}** secondes par **{}** dans `{}`. Raison : *"{}"*

source: <@{}> I've unmutted **{}**
fr: <@{}> J'ai mute **{}**

source: <@{}> Error : I can't find this user or the duration format is invalid (make sure to pass a numerical value).
fr: <@{}> Erreur : Je ne peux pas trouvé cet utilisateur ou le format de la durée est invalide (vérifiez bien que vous avez passé une valeur numérique).

source: <@{}> You've been warned by **{}** in `{}` for the following reason : *"{}"* You have now **{:,}** warns in this server.
fr: <@{}> Vous venez de recevoir un avertissement de la part de **{}** dans `{}` pour la raison suivante : *"{}"* Vous cumulez désormais **{:,}** avertissements dans ce serveur.

source: <@{}> You've been warned by **{}** in `{}`. You have now **{:,}** warns in this server.
fr: <@{}> Vous venez de recevoir un avertissement de la part de **{}** dans `{}`. Vous cumulez désormais **{:,}** avertissements dans ce serveur.

source: <@{}> **{}** has received more than **{:,}** warns *({:,})*, do you want to **kick** this user from this server ? *(Type `{}yes` or `{}no` to proceed)*
fr: <@{}> **{}** a reçu plus de **{:,}** avertissements *({:,})*, voulez-vous **expulser** cet utilisateur du serveur ? *(Tapez `{}yes` ou `{}no` à la suite pour continuer)*

source: <@{}> **{}** has received more than **{:,}** warns *({:,})*, do you want to **ban** this user from this server ? *(Type `{}yes` or `{}no` to proceed)*
fr: <@{}> **{}** a reçu plus de **{:,}** avertissements *({:,})*, voulez-vous **bannir** cet utilisateur du serveur ? *(Tapez `{}yes` ou `{}no` à la suite pour continuer)*

source: <@{}> You do not have the required permissions to proceed.
fr: <@{}> Vous n'avez pas les permissions requises pour effectuer cette action.

source: <@{}> *[KICK]* Aborting.
fr: <@{}> *[KICK]* Abandon.

source: <@{}> Kicking **{}**.
fr: <@{}> J'expulse **{}**.

source: <@{}> I'm not able to kick this user.
fr: <@{}> Je ne peux pas expulser cet utilisateur.

source: <@{}> *[KICK]* Cancellation.
fr: <@{}> *[KICK]* Annulation.

source: <@{}> *[BAN]* Aborting.
fr: <@{}> *[BAN]* Abandon.

source: <@{}> Banning **{}**.
fr: <@{}> Je bannis **{}**.

source: <@{}> I'm not able to ban this user.
fr: <@{}> Je ne peux pas bannir cet utilisateur.

source: <@{}> *[BAN]* Cancellation.
fr: <@{}> *[BAN]* Abandon.
